# ConvertElementProperties Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
NavisworksExportOptions..::..ConvertElementProperties Property
NavisworksExportOptions Class See Also
---
True to convert element properties, false otherwise. Default value is false.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool ConvertElementProperties { get; set; }
```

Visual Basic
---
```text
Public Property ConvertElementProperties As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ConvertElementProperties {
	bool get ();
	void set (bool value);
}
```

# See Also
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace